roneymonte/microchip/PIC18/08_PROTOCOLO_I2C_Master.X/main.c
/*
 * File:   main.c
 * Author: roney
 *
 * Created on 21 de Março de 2014, 16:53    -   Versao 0.1
 * Versao 0.2  - 23mar2014 - implementada comunicacao RS232 e I2C
 *               ainda desajustado com frequencia, SDA e SCL.
 * Versao 0.2a - 24mar2014 - I2C  nao funcionando, SLAVE nao respondendo.
 *               NAKs. troca endereco de 8B para 5C
 * Versao 0.2b - removidas rotinas experimentais desnecessarias.
 * Versao 0.2c - 25mar2014 - I2C/SCL nao funcionam de jeito nenhum.
 *               adicionado RTC com circuito DS1307, e tambem nao funciona.
 *               obs: usando um Arduino, tudo funciona normalmente, sem dor.
 * Versao 0.2d - cada vez pior
 * Versao 0.2e - constatados problemas na PIC18F4550, trocada pela PIC18F2525
 * Versao 0.2f - com a PIC18F2525 medindo niveis de ruido e oscilacao
 *               na alimentacao eletrica via USB, agora com capacitores
 * Versao 0.3  - FINALMENTE FUNCIONANDO, descoberta a falta de ACK na leitura
 *               dos bytes dos dispositivos SLAVEs I2C; Colocando o AckI2C() e
 *               o IdleI2C() resolveu-se o problema. Simples ?
 * Versao 0.3b - Publicando comentarios sobre os configuracoes de inicializacao
 *               e sobre os REGISTRADORES e seus VETORES de configuracao
 *
 */

#include <xc.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "configbits2525.h"     // outro arquivo config_bits.h para PIC18F4550
#include <plib/delays.h>
#include <plib/usart.h>
#include <plib/i2c.h>

#define _XTAL_FREQ 8000000
#define FOSC       8000000UL
#define Baud 100000

#define LED_AMAR    PORTCbits.RC0
#define LED_VERD    PORTCbits.RC1
#define LED_VERM    PORTCbits.RC2



/*      ** funcoes e comandos do Protocolo I2C (plib) - Compilador XC8 **
        AckI2C      :   Generate I2C? bus Acknowledgecondition.
        CloseI2C    :   Disable the SSP module.
        DataRdyI2C  :   Is the data available in the I2C buffer?
        getcI2C     :   Read a single byte from the I2C bus.
        getsI2C     :   Read a string from the I2C bus operating in master I2C mode.
        IdleI2C     :   Loop until I2C bus is idle.
        NotAckI2C   :   Generate I2C bus Not Acknowledgecondition.
        OpenI2C     :   Configure the SSP module.
        putcI2C     :   Write a single byte to the I2C bus.
        putsI2C     :   Write a string to the I2C bus operating in either Master or Slave mode.
        ReadI2C     :   Read a single byte from the I2C bus.
        RestartI2C  :   Generate an I2C bus Restartcondition.
        StartI2C    :   Generate an I2C bus Startcondition.
        StopI2C     :   Generate an I2C bus Stopcondition.
        WriteI2C    :   Write a single byte to the I2C bus.
 */

void ciclo (void);
void getDS1307(void);


/*
 *
 */

void main(void) {

    //OSCCONbits.IRCF = 0b111; // definir clock interno para 8 mhz
    //O Oscilador Interno (INTRC) nao tem precisao para gerar Clock I2C
    //Recomenda-se usar um Oscilador Externo (cristal) para maior precisao
    //Para se usar o INTRC (Oscilador Interno) deve-se mudar o arquivo
    // "configbits.h" com #Pragma config OSC INTRC (ou semelhante)

    TRISCbits.RC0=0;    // LED Amarelo para simples sinalizacao
    TRISCbits.RC1=0;    // LED Verde para simples sinalizacao
    TRISCbits.RC2=0;    // LED Vermelho para simples sinalizacao
    
    TRISCbits.RC6=1;    // TX da EUSART
                        // O programa ira informar na porta serial o status
                        // e logs de funcionamento da coleta de dados I2C

    /* 17. Module: MSSP (ERRATA for PIC18F4550 and PIC18F2525, etc)
     * ================
     *
     *  It has been observed that following a Power-on Reset, I2C mode may not
     *  initialize properly by just configuring the SCL and SDA pins as either
     *  inputs or outputs. This has only been seen in a few unique system
     *  environments. A test of a statistically significant sample of pre-
     *  production systems, across the voltage and current range of the
     *  application's power supply, should indicate if a system is
     *  susceptible to this issue.
     *
     * Work around = Before configuring the module for I2C operation:
     * 1. Configure the SCL and SDA pins as outputs by clearing
     *  their corresponding TRIS bits.
     * 2. Force SCL and SDA low by clearing the corresponding LAT bits.
     * 3. While keeping the LAT bits clear, configure SCL and SDA as
     *  inputs by setting their TRIS bits.
     *
     * Once this is done, use the SSPCON1 and SSPCON2 registers to
     *  configure the proper I2C mode as before.
     */

    TRISCbits.RC3=0;    // SCL do I2C colocado como saida por causa de bug*
    TRISCbits.RC4=0;    // SDA do I2C colocado como saida por causa de bug*
    LATC3=0;            // bug* pede que zere-se o LAT das portas SCL e SDA
    LATC4=0;            // durante inicializacao do I2C para evitar flutuacoes
                        // eletricas que ficariam nas portas antes de liga-las

    Delay10KTCYx(10);   // simples pausa para troca de estado na SDA e SCL

    TRISCbits.RC3=1;    // SCL do I2C, agora corretamente como saida
    TRISCbits.RC4=1;    // SDA do I2C, agora corretamente como saida
    // here ends "errata workaround"

    LED_AMAR=0; LED_VERM=1; LED_VERD=0;

    CMCON = 0x00;   // aplica configuracao '0' aos Comparators;
                    // teoricamente isso nada influi no funcionamento do I2C
                    // e essa configuracao poderia ser descartada

    INTCON = 0x00;  // Interrupt Control Register (desnecessario neste ponto)
                    // Esse registrador quando colocado '0', desabilita todas
                    // as configuracoes de interrupcao nos vetores abaixo:
                    // GIE/GIEH PEIE/GIEL TMR0IE INT0IE RBIE TMR0IF INT0IF RBIF
    PEIE=0;         // como o INTCON ja tinha sido zerado anteriormente
    GIE=0;          // esses dois vetores nao precisariam estar sendo zerados

     /*  O protocolo I2C utiliza os seguintes REGISTRADORES:
     *
     *  MSSP Control Register 1 (SSPCON1)
     *  =================================
     *
     *      WCOL:  Write Collision Detect bit (sem colisao = 0)
     *      SSPOV: Receive Overflow Indicator bit (sem overflow = 0)
     *      SSPEN: Master Synchronous Serial Port Enable bit (habilita pinos)
     *             Os pinos fisicos devem ser setados (TRIS) previamente com 1
     *
     *      CKP: SCK Release Control bit (segura o clock em LOW = 0, e libera o
     *           clock = 1 elevando a voltagem pull-up no pino)
      *
     *      SPM3:SSPM0: Master Synchronous Serial Port Mode Select bit
     *                  Define o TIPO MASTER (2 tipos) ou SLAVE (4 tipos)
     */


    SSPCON2=0x00;   // nao precisaria teoricamente ser zerado, pois eh
                    // controlado pelos comandos da PLIB

     /*  MSSP Control Register 2 (SSPCON2) - Detalhes no Modo Master
     *   =================================
     *
     *      GCEN: General Call Enable bit (Slave mode only) (not used in MASTER)
     *      ACKSTAT: Acknowledge Status bit, Master Transmit Only
     *              (ACK foi recebido do Slave =0; =1 nao recebeu ACK)
     *
     *      ACKDT: Acknowledge Data bit (Recepcao de ACK pelo MASTER)
     *              (ACK foi confirmado, gerou ACK)
     *
     *      ACKEN: Acknowledge Sequence Enable bit (Controla a transmissao de
     *             ACK pelo ACKDT, zerado automaticamente pelo hardware apos)
     *
     *      RCEN: Receive Enable bit (Master Receive mode only)
     *            (1 habilita a recepcao; 0 esta em modo IDLE)
     *
     *      PEN: Stop Condition Enable bit (inicia condicao de STOP = 1, e eh
     *           zerado automaticamente pelo hardware apos)
     *
     *      RSEN: Repeated Start Condition Enable bit (inicia repeticao de
     *            START e eh zerado automaticamente pelo hardware apos)
     * 
     *      SEN: Start Condition Enable/Stretch Enable bit
     *      obs: esses vetores (ACKEN, RCEN, PEN, RSEN e SEN) nao podem ser
     *           escritos no momento que o I2C estiver ativo (Startado)
     */

     /*  MSSP Control Register 2 (SSPCON2) - Detalhes no Modo Slave
     *   =================================
     *
     *      GCEN: General Call Enable bit (1= gera interrupcao quando o endereco
     *            0x0000 for recebido no SSPSR)
     *      ACKSTAT: Acknowledge Status bit (nao utilizado no modo slave)
     *      ADMSK5:ADMSK2: Slave Address Mask Select bits (1= mascaramento do
     *                     endereco Slave do SSPADD)
     *      ADMSK1: Slave Address Mask Select bit (=1 habilita mascara SSPADD)
     *      SEN: Stretch Enable bit (1= habilitado o Stretch)
     */

