roneymonte/microchip/PIC18/08_PROTOCOLO_I2C_Master.X/main.c
    SMP = 1;        // desabilita o SLEW RATE CONTROL, para 100 khz
                    // comando nao necessario, pois sera controlado pelo
                    // OpenI2C da PLIB. Vetor dentro do Registrador SSPSTAT.
     /*
     *  MSSP Status Register (SSPSTAT)
     *  ==============================
     *
     *      obs: Apenas o SMP e CKE setados para 100/400/1000khz e MASTER/SLAVE
     *      DA, P, S, RW, UA e BF sao status durante a transmissao ou recepcao
     *
     *  SMP: Slew Rate Control bit
      *      0 = 100 khz ou 1 mhz
      *      1 = 400 khz
      *
     *  CKE: SMBus Select bit
      *      Habilita o SMBus Specific Inputs
      *
     *  SSPBUF: Serial Receive/Transmit Buffer Register
     *          receive the byte from SSPSR and generate interrupt SSPIF
     *          SSPBUF/SSPRR are used also so send a byte
     *
     *  SSPSR:  Shift Register ? Not directly accessible, used for
     *                           shifting data in or out
     *  SSPADD: Address Register, address when in I2C Slave mode.
     *
     *  When the in Master mode, the lower seven bits of SSPADD act as the
     *  Baud Rate Generator (BRG) reload value
     */

    SSPIF=0;        // limpa o flag de interrupcao SSPIF
                    // nao necessario neste ponto do programa
    /*  PIR1: PERIPHERAL INTERRUPT REQUEST (FLAG) REGISTER 1
     *  ====================================================
     *          obs: existe outro PIR2 para mais perifericos
     * 
     *      SPPIF: Streaming Parallel Port Read/Write Interrupt Flag bit
     *      ADIF: A/D Converter Interrupt Flag bit
     *      RCIF: EUSART Receive Interrupt Flag bit
     *      TXIF: EUSART Transmit Interrupt Flag bit
     *      SSPIF: Master Synchronous Serial Port Interrupt Flag bit
     *             0 = esperando para receber ou transmitir
     *             1 = a recepcao ou transmissao esta completada
     *      CCP1IF: CCP1 Interrupt Flag bit
     *      TMR2IF: TMR2 to PR2 Match Interrupt Flag bit
     *      TMR1IF: TMR1 Overflow Interrupt Flag bit
     */

    BCLIF=0;        // limpa o flag de COLISAO do barramento
                    // nao necessario na inicializacao do programa
    /*  PIR2: PERIPHERAL INTERRUPT REQUEST (FLAG) REGISTER 2
     *  ====================================================
     *
     *      OSCFIF: Oscillator Fail Interrupt Flag bit
     *      CMIF: Comparator Interrupt Flag bit
     *      USBIF: USB Interrupt Flag bit
     *      EEIF: Data EEPROM/Flash Write Operation Interrupt Flag bit
     *      BCLIF: Bus Collision Interrupt Flag bit
     *             1 = houve COLISAO no barramento
     *             obs: tem que ser ZERADO em software
     *      HLVDIF: High/Low-Voltage Detect Interrupt Flag bit
     *      TMR3IF: TMR3 Overflow Interrupt Flag bit
     *      CCP2IF: CCP2 Interrupt Flag bit
     */


    //INTCON2bits.RBPU=1;   // pull up interno do PORTB desabilitado
                            // nao necessario para o I2C, default nao interfere
    /*  obs:    The weak pull-up is automatically turned off when the port
     *          pin is configured as an output. The pull-ups are disabled on
     *          a Power-on Reset.
     */

    //TRISCbits.RC6=0;    // Saida TX EUSART
    ADCON1=0x0F;              // desabilita todas as portas analogicas e
                              // as torna digitais
    //ADCON1=0x05;            //disable analog inputs on pins 33(RB0/AN12), 34(RB1/AN10) and 37(RB4/AN11)
    //PORTD=0x00; //PORTCbits.RC2=0;

    

    //SSPCON1bits.SSPEN=1;
    //SSPCON1=0x00;
    //SSPCON2=0x00;
    //SSPSTATbits.SMP = 1;        // desabilita o SLEW RATE CONTROL para 100 khz
    //PIR1bits.PSPIF=0;  // clear SSPIF interrupt flag
    //PIR2bits.BCLIF=0;  // clear bus collision flag
    //SSPSTAT=0x00;
    //CMCON=0x00;


    /*
 

    SSPSTATbits.CKE=0;  // use I2C levels worked also with '0'

    SSPSTATbits.SMP=1;  // disable slew rate control worked also with '0'
    PIR1bits.PSPIF=0;  // clear SSPIF interrupt flag
    PIR2bits.BCLIF=0;  // clear bus collision flag

    PIR1bits.SSPIF = 0;                  // Clear the serial port interrupt flag
    PIR2bits.BCLIF = 0;                  // Clear the bus collision interrupt flag
                                         // limpa o flag de COLISAO do barramento
    PIE2bits.BCLIE = 1;                  // Enable bus collision interrupts
    PIE1bits.SSPIE = 1;                  // Enable serial port interrupts

    INTCONbits.PEIE = 1;                   // Enable peripheral interrupts
    INTCONbits.GIE = 1;                     // Enable global interrupts
    INTCONbits.GIE_GIEH  = 1;       // GIE/GIEH: Global Interrupt Enable bit
    INTCONbits.PEIE_GIEL = 1;       // PEIE/GIEL: Peripheral Interrupt Enable bi

    PIR1bits.SSPIF = 0;             // Clear MSSP interrupt request flag
                                    // limpa o flag de interrupcao SSPIF
    PIE1bits.SSPIE = 1;             // Enable MSSP interrupt enable bit

    SSPCON2bits.SEN = 1;        // Clock stretching is enabled
    //SSPCON1bits.CKP = 1;            // release CLK

    SSPCON1        = 0x36;          // SSPEN: Synchronous Serial Port Enable bit - Enables the serial port and configures the SDA and SCL pins as the serial port pins
                                    // CKP: SCK Release Control bit              - Release clock
                                    // SSPM3:SSPM0: SSP Mode Select bits         - 0110 = I2C Slave mode, 7-bit address
    SSPSTAT        = 0x00;
    //SSPCON2        = 0x01;          // GCEN: General Call address (00h) (Slave mode only) 0 = General call address disabled
                                    // SEN: Start Condition Enable/Stretch Enable bit(1) ()Slave mode) 1 = Clock stretching is enabled
    
    SSPSTATbits.SMP = 1;        // desabilita o SLEW RATE CONTROL para 100 khz

     */

    //SSPADD = 0x27; // para 100 khz e clock de 8 mhz

    //IdleI2C();                    // Wait for the bus get idle

    // SSPADD = (( FOSC/ Bit Rate) /4 ) - 1;
    // SSPADD = ( 4.000.000/100.000 )/4 -1
    // SSPADD = ( 40 ) / 4 -1 = 10-1 = 9

