roneymonte/microchip/PIC18/08_PROTOCOLO_I2C_Master.X/main.c
        /*Delay10KTCYx(100);Delay10KTCYx(100);Delay10KTCYx(100);
        Delay10KTCYx(100);Delay10KTCYx(100);*/

    }



}

void getDS1307(void)
{
    int hora=0, minuto=0, segundo=0, diasemana=0, dia=0, mes=0, ano=0, dummy=0;
    char msg[40];


    IdleI2C();
    RestartI2C();
        //IdleI2C();
        __delay_us(16);
        WriteI2C( 0xD0 );
        //IdleI2C();
        __delay_us(60);
        WriteI2C( 0x00 );
        IdleI2C();
        __delay_us(16);
        //AckI2C();AckI2C();AckI2C();AckI2C();AckI2C();AckI2C();AckI2C();AckI2C();
    StopI2C();

    //IdleI2C();
    __delay_us(26);

    RestartI2C();
        __delay_us(16);
        WriteI2C( 0xD1 );
        //LED_AMAR = 0;
        //while(!DataRdyI2C()) LED_VERM=~LED_VERM;
        __delay_us(1);
        IdleI2C();

        segundo    =ReadI2C();
        AckI2C();
        IdleI2C();

        minuto  =ReadI2C();
        AckI2C();
        IdleI2C();

        hora =ReadI2C();
        AckI2C();
        IdleI2C();

        diasemana=ReadI2C();
        AckI2C();
        IdleI2C();

        dia     =ReadI2C();
        AckI2C();
        IdleI2C();

        mes     =ReadI2C();
        AckI2C();
        IdleI2C();

        ano     =ReadI2C();
        AckI2C();
        IdleI2C();

        dummy   =ReadI2C();
        //AckI2C();
        //__delay_us(16);
        //IdleI2C();
        //NotAckI2C();
        //IdleI2C();
    StopI2C();


    LED_VERM = 0;

    while(BusyUSART());
                putrsUSART("SSPAD=0x");
                while(BusyUSART());
                putsUSART( itoa(NULL,SSPADD,16) );


    sprintf(msg,"(%d) __ %xh:%xm:,%xs _ dia %x/%x/%x\r\n", SSPADD,hora,minuto,segundo,
            dia,mes,ano);

    while(BusyUSART());
                putsUSART( msg );
}